# todo: Определить в коде переменные:
# 1. Целочисленного типа
number = 777
# 2. Вещественного типа
digit = 77.7
# 3. Логического типа
boolean = True
# 4. Строкового типа
word = "word"
# 5. Пустого типа
empty = None
# Вывести их типы. 123
print( type(number), type(digit), type(boolean), type(word), type(None) )